{"_id":"6803cf5bf2d0c69d7f86622e","name":"Silverman Sachs","logoUrl":"https://github.com/samkitsamsukha/csr-kive/blob/main/assets/logo.png","vision":"At Silverman Sachs, we envision a future where financial empowerment and technological innovation go hand in hand. Our goal is to democratize access to sophisticated financial tools and insights, enabling individuals and businesses worldwide to make smarter, data-driven decisions that drive growth, security, and long-term value.","mission":"Our mission is to redefine the financial landscape through cutting-edge technology, ethical practices, and client-centric solutions. We strive to deliver seamless digital platforms, intelligent investment strategies, and fintech services that adapt to the evolving needs of our global clientele while fostering transparency, inclusion, and sustainability.","objectives":["Develop and deploy next-gen financial technologies, including AI-powered analytics, blockchain integration, and secure cloud-based solutions.","Provide accessible, user-friendly tools and expert guidance to help individuals and organizations optimize financial performance.","Uphold the highest standards of corporate governance, data privacy, and ethical investment to build lasting trust and positive societal impact."],"csrPhilsophy":"At Silverman Sachs, we believe that true success extends beyond financial performance — it encompasses our responsibility to people, communities, and the planet. Our CSR philosophy is rooted in the idea that innovation and impact must go hand in hand. We are committed to creating sustainable value by integrating ethical practices, environmental stewardship, and social equity into every aspect of our business. Whether through financial literacy initiatives, tech-driven sustainability solutions, or inclusive workplace culture, we aim to be a catalyst for positive change. Our approach to CSR is not a checkbox — it is a core pillar of our identity, guiding how we operate, whom we partner with, and the legacy we strive to leave behind.","adminName":"Thomas Augustine","adminEmail":"admin@silvermansachs.com","events":[{"eventName":"Pawtection Drive: Care for Bengaluru’s Strays","eventDate":"2025-04-19T16:58:27.904Z","eventDescription":"As part of Silverman Sachs' CSR commitment towards community well-being, Pawtection Drive aims to uplift the lives of stray animals in the heart of Bengaluru. In collaboration with local animal shelters and veterinary volunteers, this day-long initiative includes street animal health check-ups, vaccination drives, food and water bowl installations, and an adoption awareness camp. Volunteers from Silverman Sachs will actively participate in setting up aid stations, interacting with animal welfare workers, and supporting medical camps. The event not only fosters compassion but also promotes a cleaner, more humane urban ecosystem.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/animal_welfare.png","eventLocation":"Cubbon Park, Bengaluru","eventCoins":20,"eventCategory":"animal_welfare","eventSummary":"The event will serve as a constant reminder to how important the animal community is.","_id":"6803d82ebf873e1982ad9eee","submissions":[{"employeeId":"6802665e09c6db38baa6739b","employeeName":"Samkit Samsukha","report":"The Petwalk held at Cubbon Park was a delightful event celebrating the bond between pets and their owners. Enthusiasts from across the city gathered early morning with their furry companions for a refreshing walk amidst nature. The event featured fun activities like pet games, grooming stalls, and awareness sessions on pet care. It fostered a sense of community among pet lovers while promoting responsible ownership. The vibrant atmosphere, coupled with wagging tails and cheerful barks, made the morning truly memorable. Petwalk at Cubbon Park was a joyful celebration of love, companionship, and healthy living.","picture":"https://github.com/samkitsamsukha/csr-kive/blob/main/assets/petwalk.png","_id":"6803ea7bbf873e1982ada1c3"},{"employeeId":"6803db26bf873e1982ad9f71","employeeName":"Piyush Kheria","report":"I participated in the Animal Welfare Awareness Drive organized as part of Silverman Sachs’ CSR initiative. The event focused on educating the public about responsible pet ownership and stray animal care. We collaborated with local shelters, distributed informational pamphlets, and assisted in a vaccination camp. It was a rewarding experience that deepened my understanding of humane treatment and animal rights.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/animal1.png","_id":"6803f323bf873e1982ada648"},{"employeeId":"6803db3cbf873e1982ad9f73","employeeName":"Oojam Chaudhary","report":"As part of the animal welfare event, I volunteered in organizing an adoption and donation drive in collaboration with a local NGO. We helped rehome abandoned animals and raised funds for shelter operations. The event highlighted the importance of compassion, and I felt proud contributing to a cause that protects voiceless beings in our community.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/animal2.png","_id":"6803f420bf873e1982ada720"},{"employeeId":"6803db5fbf873e1982ad9f77","employeeName":"Sathvik Hegde","report":"The Animal Welfare Day at Silverman Sachs was an enriching experience. I joined a team to conduct awareness sessions in schools, emphasizing kindness towards animals. We also supported a feeding drive for stray dogs and cats. Witnessing the community’s response reaffirmed my belief in spreading empathy and taking small steps to make a big impact.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/animal3.png","_id":"6803f455bf873e1982ada771"}]},{"eventName":"LifeLine Drive: Donate Blood, Save Lives","eventDate":"2025-04-26T17:07:42.000Z","eventDescription":"In alignment with Silverman Sachs’ commitment to health and social responsibility, the LifeLine Drive is a corporate blood donation initiative conducted in association with local hospitals and blood banks. The event provides a safe and well-equipped setup for employees and volunteers to donate blood, helping to meet the city’s critical blood supply needs. Certified medical professionals will be on-site to manage the donation process, educate donors, and ensure safety and comfort throughout. The drive encourages team spirit, empathy, and active contribution to public health.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/blood_donation.png","eventLocation":"Silverman Sachs Tech Park Campus, Whitefield, Bengaluru","eventCoins":10,"eventCategory":"healthcare","eventSummary":"The LifeLine Drive saw enthusiastic participation from over 120 employees and volunteers, resulting in 95 successful blood donations. The collected units were handed over to NIMHANS Blood Bank, Bengaluru. Awareness booths and pre-donation health screenings were also part of the event. The drive not only contributed to saving lives but also strengthened Silverman Sachs’ culture of compassionate corporate citizenship.","_id":"6803d8bfbf873e1982ad9f06","submissions":[]},{"eventName":"Future Forward: Career Guidance & Mentorship Program","eventDate":"2025-04-08T17:11:33.000Z","eventDescription":"\"Future Forward\" is a CSR-driven career guidance event aimed at empowering high school students in Bengaluru with the knowledge, mentorship, and motivation needed to make informed career choices. Organized by Silverman Sachs, this initiative brings together professionals from diverse fields to engage with students through interactive sessions, career talks, and one-on-one mentorship. The event is designed to bridge the gap between academic learning and real-world opportunities, especially for students from underserved backgrounds.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/career_guidance.png","eventLocation":"Government High School, Indiranagar, Bengaluru","eventCoins":20,"eventCategory":"vocational_training","eventSummary":"As part of our Corporate Social Responsibility efforts, Silverman Sachs hosted \"Future Forward\" at Government High School, Indiranagar, Bengaluru. The event featured expert-led sessions on career planning, soft skills development, and higher education opportunities. With a focus on inclusivity and empowerment, the program provided students with valuable insights and tools to explore various career paths. The initiative reflects our commitment to fostering education and community development.","_id":"6803d9f30dc9cb3bec4f519e","submissions":[{"employeeId":"6803da26bf873e1982ad9f1e","employeeName":"Samkit Samsukha","report":"A career guidance session was conducted by me to help students navigate their professional journeys with clarity and confidence. The session focused on identifying individual strengths, understanding industry trends, and exploring diverse career paths. Through interactive discussions and real-life examples, students gained insights into building effective resumes, preparing for interviews, and setting achievable goals. The session also highlighted the importance of upskilling and continuous learning. Participants actively engaged in Q&A, sharing their aspirations and concerns. Overall, the session was impactful, empowering students with direction and motivation to pursue their careers with purpose and preparedness.","picture":"https://github.com/samkitsamsukha/csr-kive/blob/main/assets/career.png","_id":"6803ee26bf873e1982ada39e"},{"employeeId":"6803db4bbf873e1982ad9f75","employeeName":"Roshan Sarmah","report":"I participated in the Career Guidance Workshop organized by Silverman Sachs as part of our CSR outreach. We conducted interactive sessions at a government high school in Bengaluru, guiding students on future career paths, entrance exams, and skill development. It was inspiring to see the students’ enthusiasm and curiosity. The experience reminded me of the power of mentorship and how access to the right information can shape futures.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/career1.png","_id":"6803f4a8bf873e1982ada837"},{"employeeId":"6803db26bf873e1982ad9f71","employeeName":"Piyush Kheria","report":"As a volunteer in the CSR Career Guidance event, I delivered a session on career options in technology and finance for underprivileged students. We also conducted mock interviews and resume-building workshops. The students were highly engaged, and many shared their aspirations. Being part of their learning journey was fulfilling and reinforced the importance of early career exposure.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/career2.png","_id":"6803f4d3bf873e1982ada86c"}]},{"eventName":"Hope Rising: Disaster Relief Fundraiser Drive","eventDate":"2025-04-15T17:14:57.000Z","eventDescription":"\"Hope Rising\" is a Corporate Social Responsibility (CSR) initiative by Silverman Sachs, dedicated to supporting communities impacted by recent natural disasters. The event is a heartfelt call to action, bringing together employees, partners, and the local community to raise critical funds through charity auctions, cultural performances, donation drives, and awareness campaigns. All contributions are directed to trusted NGOs providing essential relief including shelter, food, medical aid, and long-term rehabilitation.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/fund_raiser.png","eventLocation":"Community Hall, JP Nagar, Bengaluru","eventCoins":15,"eventCategory":"disaster_relief","eventSummary":"As part of its CSR mission, Silverman Sachs hosted the “Hope Rising” disaster relief fundraiser at Community Hall, JP Nagar, Bengaluru. The event brought together a diverse group of attendees — from employees and local residents to artists and volunteers — all united by a shared goal: to aid those in crisis. Through engaging activities and community spirit, the event successfully raised significant funds and heightened awareness about disaster response and recovery. “Hope Rising” reflected Silverman Sachs’ enduring commitment to social impact and community resilience.","_id":"6803daca0dc9cb3bec4f51ac","submissions":[{"employeeId":"6803db4bbf873e1982ad9f75","employeeName":"Roshan Sarmah","report":"I participated in the “Hope Rising” disaster relief fundraiser organized by Silverman Sachs. I helped coordinate donation booths and interacted with attendees to spread awareness about the relief efforts. It was heartening to see how generously people contributed. The experience reinforced the importance of community support during times of crisis.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/disaster1.png","_id":"6803f681bf873e1982adab63"},{"employeeId":"6803db5fbf873e1982ad9f77","employeeName":"Sathvik Hegde","report":"As a volunteer at the disaster relief fundraiser, I assisted in organizing a charity auction and cultural performances to raise funds for affected communities. The event was well-received, and the funds collected were directed to a trusted NGO. Contributing to such a meaningful cause was truly fulfilling.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/disaster2.png","_id":"6803f6a2bf873e1982adabdb"},{"employeeId":"6803db3cbf873e1982ad9f73","employeeName":"Oojam Chaudhary","report":"I was part of the organizing team for Silverman Sachs’ disaster relief CSR event. My role involved managing logistics and supporting digital promotions to maximize outreach. The strong turnout and enthusiastic participation showed the power of collective action in providing timely aid to those in need.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/disaster3.png","_id":"6803f6b0bf873e1982adabfe"}]},{"eventName":"GreenStride: Run for a Greener Tomorrow","eventDate":"2025-04-21T17:18:21.000Z","eventDescription":"GreenStride is an environment-focused marathon organized by Silverman Sachs as part of its Corporate Social Responsibility (CSR) efforts to promote environmental awareness and action. Set against the scenic backdrop of Cubbon Park, the event aims to encourage sustainable living, tree plantation, and eco-conscious behavior. Participants of all ages joined to run for a cause—supporting local environmental NGOs and promoting green initiatives such as afforestation, clean-up drives, and renewable energy education.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/marathon.png","eventLocation":"Cubbon Park, Bengaluru","eventCoins":20,"eventCategory":"environment","eventSummary":"Silverman Sachs hosted the GreenStride marathon at Cubbon Park, Bengaluru, as part of its CSR initiative focused on environmental sustainability. The event brought together employees, environmental activists, fitness enthusiasts, and citizens for a morning of meaningful activity and community bonding. Alongside the run, the event featured eco-awareness booths, waste segregation workshops, and a symbolic tree-planting ceremony. GreenStride highlighted Silverman Sachs’ dedication to a cleaner, greener future and mobilized collective action toward environmental stewardship.","_id":"6803e29b0dc9cb3bec4f51bd","submissions":[]},{"eventName":"Roots of Change: Community Plantation Drive","eventDate":"2025-04-17T17:51:51.000Z","eventDescription":"Roots of Change is a tree plantation drive organized by Silverman Sachs under its Corporate Social Responsibility (CSR) program, aiming to promote urban greenery and environmental sustainability. Held at Lalbagh Botanical Garden, the event brings together employees, volunteers, and local residents to plant native tree species, support biodiversity, and raise awareness about the importance of green cover in combating climate change and improving air quality in urban spaces.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/plantation_drive.png","eventLocation":"Lalbagh Botanical Garden, Bengaluru","eventCoins":10,"eventCategory":"environment","eventSummary":"As part of its ongoing CSR commitment to environmental conservation, Silverman Sachs organized the Roots of Change plantation drive at Lalbagh Botanical Garden, Bengaluru. The event witnessed active participation from employees, eco-volunteers, and community members who planted hundreds of saplings across designated areas. Informative sessions on native species and sustainable gardening practices were also conducted. The drive reinforced Silverman Sachs’ vision of creating a greener and healthier urban environment through meaningful, hands-on action.","_id":"6803e3030dc9cb3bec4f51dd","submissions":[{"employeeId":"6803db4bbf873e1982ad9f75","employeeName":"Roshan Sarmah","report":"I was part of the plantation drive organized by Silverman Sachs at Lalbagh Botanical Garden. Alongside fellow volunteers, we planted a variety of native saplings and learned about their role in improving air quality and supporting biodiversity. It was refreshing to contribute directly to the environment and witness the collective effort toward a greener Bengaluru.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/plantation1.png","_id":"6803f5ffbf873e1982ada9e9"},{"employeeId":"6803db26bf873e1982ad9f71","employeeName":"Piyush Kheria","report":"Participating in the community plantation event was a fulfilling experience. We planted trees in a designated urban zone and attended a short workshop on the importance of green cover in combating climate change. Seeing employees and local residents work together reminded me how small actions can create lasting environmental impact.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/plantation2.png","_id":"6803f624bf873e1982adaa2c"},{"employeeId":"6803db3cbf873e1982ad9f73","employeeName":"Oojam Chaudhary","report":"The plantation drive organized as part of our CSR efforts was a hands-on opportunity to give back to nature. I joined the planning team, coordinated sapling distribution, and helped document the event. Planting trees and seeing the enthusiasm of participants made it a truly rewarding and hopeful initiative.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/plantation3.png","_id":"6803f641bf873e1982adaa72"}]},{"eventName":"EqualAbility: Empowering Every Voice","eventDate":"2025-04-20T17:53:26.000Z","eventDescription":"EqualAbility is a CSR initiative by Silverman Sachs dedicated to empowering Persons with Disabilities (PwD) through inclusion, support, and skill-building. Hosted at the Silverman Sachs Bengaluru Campus, the event aims to raise awareness, foster dialogue, and provide opportunities for individuals with disabilities through workshops, assistive technology showcases, employment guidance, and inclusive cultural programs. The initiative also promotes accessible workplace practices and community engagement.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/pwd.png","eventLocation":"Silverman Sachs Bengaluru Campus, Manyata Tech Park","eventCoins":10,"eventCategory":"support_differently_abled","eventSummary":"As part of its Corporate Social Responsibility agenda, Silverman Sachs conducted the EqualAbility event at its Bengaluru campus in Manyata Tech Park. The event brought together PwD advocates, NGOs, corporate leaders, and community members in a celebration of inclusion and accessibility. With activities ranging from panel discussions to talent showcases and employment support kiosks, EqualAbility highlighted the capabilities and contributions of persons with disabilities. The initiative reinforced Silverman Sachs’ commitment to building a more inclusive and equitable society for all.","_id":"6803e35f0dc9cb3bec4f51f4","submissions":[]},{"eventName":"JalRaksha: Water Awareness & Conservation Drive","eventDate":"2025-04-19T17:54:53.829Z","eventDescription":"JalRaksha is a World Water Day awareness initiative by Silverman Sachs, aimed at educating communities about the importance of water conservation, sustainable usage, and protecting local water bodies. Held at the iconic Ulsoor Lake, the event includes clean-up drives, interactive exhibits, expert talks on water sustainability, school outreach programs, and community art installations. Through this CSR activity, Silverman Sachs reaffirms its commitment to environmental responsibility and urban water stewardship.","eventImage":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/events_banner/water_day.png","eventLocation":"Ulsoor Lake Promenade, Bengaluru","eventCoins":10,"eventCategory":"environment","eventSummary":"To mark World Water Day, Silverman Sachs organized JalRaksha at Ulsoor Lake, Bengaluru, as part of its Corporate Social Responsibility (CSR) efforts. The event featured a series of impactful activities including lakefront clean-up, water conservation workshops, and awareness campaigns involving schools and local residents. The initiative emphasized the urgent need for collective water consciousness in urban areas and reinforced Silverman Sachs’ dedication to fostering a sustainable and water-resilient future.","_id":"6803e3bd0dc9cb3bec4f520e","submissions":[{"employeeId":"6803db3cbf873e1982ad9f73","employeeName":"Oojam Chaudhary","report":"I took part in the Water Day Awareness event organized by Silverman Sachs at Ulsoor Lake. Our team conducted a lakefront clean-up and engaged with local residents on water conservation practices. We also helped set up informational booths on rainwater harvesting and reducing water waste. It was a meaningful experience that emphasized the importance of protecting our water resources for future generations.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/water1.png","_id":"6803f515bf873e1982ada8e4"},{"employeeId":"6803db5fbf873e1982ad9f77","employeeName":"Sathvik Hegde","report":"As a volunteer in the Water Day Awareness campaign, I participated in an awareness rally and helped facilitate educational games for school children on water-saving habits. The event also featured expert talks on Bengaluru’s water crisis and practical solutions. It felt great to be part of an initiative that combined community involvement with environmental education.","picture":"https://github.com/samkitsamsukha/hf-csr-kive/blob/main/assets/report_img/water2.png","_id":"6803f586bf873e1982ada963"}]}],"__v":25}